using System;
using System.Collections.Generic;

namespace TasksFromHighSkills2020
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
            Задача № 8
            Задание оценивается в 18 баллов
            Али играет с кубиками сахара. 
            Он собирает из нее ступеньки. Каждый верхний слой ступенек у Али меньше предыдущего. 
            Он хочет знать сколько всего таких ступенек можно собрать из N кубиков сахара. 
            Помогите ему с этой задачей и напишите для этого программу.
            Объяснение: 
            У вас есть 6 кубиков сахара: ######
            Из них можно сделать следующие ступени:
            1)	######
            
            2)	#
                #####
            
            3)	##
                ####
           
            4)	#
                ##
                ###
            Значит количество возможных ступеней из 6 кубиков сахара - 4
            Пример входных данных:
            7
            Пример выходных:
            5


             */
            // Решение 

           
        }
    }
}
